{"-7yF42k0CcJhtPw51oaOqQ": {"positive": "31.2617702%", "negative": "37.2262774%", "name": "Bellagio Hotel", "star": "3.98", "image_url": "https://www.visitsitaly.com/tours/campania/rentals/hotel_santa_caterina/hotel_santa_caterina_pool.jpg", "rank": "0.99", "city": "Las Vegas", "reviews": [{"date": "2014-12-31", "probability": "NA", "type": "Truthful", "review": "Amazing!  This hotel is all around amazing.  From the moment you get off of the cab/shuttle/car your  are living the Vegas experience.   Located in the center of the strip, easy access to other attractions. \n\nNice big lobby filled with flowers and lots of plants.  They have a small mall (LV, Armani, Chanel, high end stores) located within the mall.\n\nI have been here twice and the first time I went we got a room that was beautiful.  I man everything was wood, huge bathroom with marble floors, super nice comfy beds.   The second time we had a nice room also, but different.  It was smaller and the furniture was just average.\n\nThe rates are a  bit on the higher end, but it is a nice hotel.   Worth it, I would recommend this hotel.", "stars": "4", "name": "diana"}]}, "hW0Ne_HTHEAgGF1rAdmR-g": {"positive": "24.0909091%", "negative": "26.8456376%", "name": "Phoenix Sky Harbor International Airport", "star": "3.3", "image_url": "https://www.visitsitaly.com/tours/campania/rentals/hotel_santa_caterina/hotel_santa_caterina_pool.jpg", "rank": "0.16", "city": "Phoenix", "reviews": [{"date": "2014-12-31", "probability": "NA", "type": "Truthful", "review": "Nice. Clean. Modern. Easy navigation around the terminals. TSA agents are usually pretty friendly. All in all a good airport to fly into and out of.", "stars": "4", "name": "John"}]}, "TWD8c5-P7w9v-2KX_GSNZQ": {"positive": "21.7573222%", "negative": "34.6846847%", "name": "Mandalay Bay Resort & Casino", "star": "3.5", "image_url": "https://www.visitsitaly.com/tours/campania/rentals/hotel_santa_caterina/hotel_santa_caterina_pool.jpg", "rank": "0.52", "city": "Las Vegas", "reviews": [{"date": "2014-12-31", "probability": "NA", "type": "Truthful", "review": "After reading MANY reviews of five and near five star resorts in Las Vegas, one may get the impression that the North end of the strip. Isn't the North strip home to the boarded up Sahara? The Fontainebleau Las Vegas that never even opened? And lest we forget the opulent Circus Circus? The South Strip is where the action is! And it has fewer of those nasty card peddlers!\n\nThe crown gem of the South Strip is obviously Mandalay Bay Resort! Just walking in you can smell your in a different world. Marble and other expensive building materials are everywhere! And the outside of the building is acres and acres of exotic waterfalls, sculpture gardens and trees! And unlike Wynn (NICE but North Strip) Mandalay Bay has real grass and plants. Even the Palazzo is using fake plants these days. What's with that? Anyway - the grounds look and feel expensive because it cost a fortune to build. And it's comfortable and quiet in most of the public spaces except the pool area (second to none) and the exciting casino.\n\nThis resort underwent a room renovation a few years ago to kill off the beach bungalow look and removed any trace of of a tropical theme. The new room decor is bright, modern and welcoming! Sound-proofing is good and the bathroom is massive and includes two sinks and an HDTV.\n\nSome people say that visitors to Las Vegas don't spend time in thier room. WRONG again! Why do you think the rooms and suites keep getting bigger and more plush? Because people do spend time in their rooms relaxing and entertaining or maybe even kicked back on the bed watching a high-def movie. Ask anyone who has spent a lot of time at the nicer resorts and they will tell you that the floor to ceiling glass curtain wall provides the most spectacular views of the strip. The whole strip just unfolds in front of you at night.\n\nThe resort is also home to one of the worlds largest convention centers and it's own event/concert center. And every food choice imaginable is available either at the resort, at Mandalay Place or a quick tram-ride to Luxor, Excalibur, NYNY and the MGM Grand. And unlike the Las Vegas monorail the tram is free and better located. You have to walk miles to catch the monorail.\n\nThe only thing I noticed on my last trip that needed some attention was the parking garage. It used to be kept cleaner but I noticed empty beer and other liquor bottles scattered around. Guess I wasn't invited to the party!\n\nI've only seen the massive pool area a few times, but it includes a lazy river, a wave pool, beach, and numerous pools including a more adult one. The pool complex would be awesome if they could just nix the children completely (especially the loud ones) but some resorts must bear the burden of accommodating children. But Las Vegas is NOT a family destination. \n\nI've enjoyed this resort for many years and plan on returning again soon. Be sure to see the photos.\n\nRoom Tip: High floor room facing the strip!\n\nSide Note: I have not been in a year and refused to go, until they do an early cancellation of a Michael Jackson show. He frightens children and most adults and is dead.", "stars": "5", "name": "Rex"}]}, "kEC7OlpPnZRxCUyVwq7hig": {"positive": "22.9050279%", "negative": "28.4090909%", "name": "Hard Rock Hotel & Casino", "star": "3.23", "image_url": "https://www.visitsitaly.com/tours/campania/rentals/hotel_santa_caterina/hotel_santa_caterina_pool.jpg", "rank": "0.09", "city": "Las Vegas", "reviews": [{"date": "2014-12-31", "probability": "NA", "type": "Truthful", "review": "If you are a business person, don't stay here. The crowd is pretty low rent, restaurants (minus NOBU) are ok at best. Thinking they have the worst/slowest internet I've ever experienced. it's actually mindblowingly slow. I give this place a C- at best.", "stars": "2", "name": "Alicia"}]}, "_v6HIliEOn0l0YaAmBOrxw": {"positive": "13.5%", "negative": "32.8431373%", "name": "Treasure Island, LLC", "star": "3.29", "image_url": "https://www.visitsitaly.com/tours/campania/rentals/hotel_santa_caterina/hotel_santa_caterina_pool.jpg", "rank": "0.15", "city": "Las Vegas", "reviews": [{"date": "2014-12-30", "probability": "NA", "type": "Truthful", "review": "Stayed here for 5 days and 4 nights. Upon checking in, I was upgraded to the top floor room with the panoramic view! The view was lovely, especially in the early morning to watch the sunrise. The staff was helpful and friendly:) The casino area was clean and not to crowded, and the buffet (of course) is worth stopping to have dinner at. Only complaint I would have is the prices of non alcoholic drinks and food.. One example: $3 for a small bottle of water!", "stars": "4", "name": "Tasha"}]}, "ripCiWZ0MblMZSLrIKQAKA": {"positive": "18.220339%", "negative": "27.2727273%", "name": "Monte Carlo Hotel And Casino", "star": "2.96", "image_url": "https://www.visitsitaly.com/tours/campania/rentals/hotel_santa_caterina/hotel_santa_caterina_pool.jpg", "rank": "0.0", "city": "Las Vegas", "reviews": [{"date": "2014-12-31", "probability": "NA", "type": "Truthful", "review": "Do not stay here unless you want blood on your sheets PRIOR to checking in. UNACCEPTABLE. WILL NOT PAY THIS MUCH FOR A \"6 star hotel.\"", "stars": "1", "name": "Johnny"}]}, "z3SyT8blMIhsZNvKJgKcRA": {"positive": "22.2222222%", "negative": "34.0206186%", "name": "Caesars Palace Las Vegas Hotel & Casino", "star": "3.46", "image_url": "https://www.visitsitaly.com/tours/campania/rentals/hotel_santa_caterina/hotel_santa_caterina_pool.jpg", "rank": "0.43", "city": "Las Vegas", "reviews": [{"date": "2014-12-30", "probability": "NA", "type": "Truthful", "review": "The WORST!!! Buyer beware! Paid $130 to stay 19 hours 4pm check in, 11am check out. Trashy! dirty! RUDE GUST SERVICES! Mold in bathrooms.", "stars": "1", "name": "Su"}]}, "DUdBbrvqfaqUe9GYKmYNtA": {"positive": "19.8547215%", "negative": "30.5555556%", "name": "The Mirage", "star": "3.6", "image_url": "https://www.visitsitaly.com/tours/campania/rentals/hotel_santa_caterina/hotel_santa_caterina_pool.jpg", "rank": "0.72", "city": "Las Vegas", "reviews": [{"date": "2014-12-30", "probability": "NA", "type": "Truthful", "review": "After an impromptu decision to flee with the kids to Vegas, we ended up choosing the Mirage. The price was quite reasonable and it's location ideal for walking the strip. Once we checked in we went up to our room. The rooms are immaculate and the hotel supplied toiletries, towels and bedding to accommodate the 4 of us. We've stayed at hotels before where we've had to make several requests for such items. \n~Our kids loved the volcano show. \n~The restaurants at the hotel were decent. We ate at Carnegie's deli and BLT burger in lieu of the buffet for dinner. \n~The buffet at the mirage is AMAZING for the price. They even give you a AAA discount at the buffet, which is 20% off. \nOverall, a stellar experience for the price and class of hotel. We would most definitely stay again!", "stars": "5", "name": "Mary"}]}, "G0nUhYF2q4tnoOPwCjXLig": {"positive": "19.6721311%", "negative": "32.5443787%", "name": "Excalibur Hotel", "star": "2.73", "image_url": "https://www.visitsitaly.com/tours/campania/rentals/hotel_santa_caterina/hotel_santa_caterina_pool.jpg", "rank": "0.0", "city": "Las Vegas", "reviews": [{"date": "2014-12-30", "probability": "NA", "type": "Truthful", "review": "Just spent 3 days there. I usually stay at the Monte Carlo but decided to switch things up this time.after reading some of the reviews I was getting worried but to my surprise the room was very clean and well taken care of. The gaming was awesome and the restaurants were also very good especially Dicks Last Resort it was the bomb. I would recommend this place for anyone that want s to go to Vegas on the cheap. Well worth every penny I spent!", "stars": "4", "name": "Vinnie"}]}, "u9wjRhUjySkHPa_hG3kFOg": {"positive": "32.2742475%", "negative": "26.4705882%", "name": "Wynn Las Vegas", "star": "4.14", "image_url": "https://www.visitsitaly.com/tours/campania/rentals/hotel_santa_caterina/hotel_santa_caterina_pool.jpg", "rank": "1.0", "city": "Las Vegas", "reviews": [{"date": "2014-12-29", "probability": "NA", "type": "Truthful", "review": "Maybe my expectations were too high because I was honestly a little disappointed in the Wynn.\n\nWe checked in late on a Friday and maybe the woman that helped us was tired or something because she was not very friendly. I asked for a room on a high floor - we got the 8th floor - so that didn't work.\n\nThe room itself was nice but like I said I guess I was expecting more. It was just very ordinary, like a room you expect to find anywhere. I thought with the Wynn I would get a \"wow\" factor but I didn't. The window shades are controlled by a remote panel which is fun for the first few minutes but that's about it. \n\nThe bed was very comfortable though so I'll give them that.\n\nI also did like the pool area quite a bit. It's large with lots of great places to lay out. We went later in the day so it was pretty quiet. I'm not into the pool party scene so I liked that it was more laid back. I think the Encore is where the party is at if that's your thing.\n\nThe other downside to the Wynn is that it's on the end of the strip so it's just that much more walking to get to the action.\n\nNext time we're in Vegas I think we'll stay a little more center to the action, like Bellagio.", "stars": "3", "name": "Holly"}]}, "NGJDjdiDJHmN2xxU7KauuA": {"positive": "12.4203822%", "negative": "34.0686275%", "name": "Flamingo Las Vegas Hotel & Casino", "star": "2.89", "image_url": "https://www.visitsitaly.com/tours/campania/rentals/hotel_santa_caterina/hotel_santa_caterina_pool.jpg", "rank": "0.0", "city": "Las Vegas", "reviews": [{"date": "2014-12-30", "probability": "NA", "type": "Truthful", "review": "Love this casino, too much fun, great customer service. Cocktail waitress so funny and actually are not stuck as the other ones. Security really nice and not rude as others. Such a good vibe.", "stars": "5", "name": "Kathie"}]}, "eRRyfI6QVvSviirRF8UGzQ": {"positive": "26.5625%", "negative": "33.3333333%", "name": "Encore", "star": "4.15", "image_url": "https://www.visitsitaly.com/tours/campania/rentals/hotel_santa_caterina/hotel_santa_caterina_pool.jpg", "rank": "1.0", "city": "Las Vegas", "reviews": [{"date": "2014-12-26", "probability": "NA", "type": "Truthful", "review": "What a view! Our room faced the south side which had the view of the strip and the golf course. The front desk gave us the heads up about the noise from their two night clubs at night; a little muffled thumping noise but hardly a nuisance. Encore was quieter and much more relaxed than other big casino hotels. I would love to go back if I can afford to stay here.", "stars": "4", "name": "Jim"}]}, "34uJtlPnKicSaX1V8_tu1A": {"positive": "22.7154047%", "negative": "32.4675325%", "name": "The Venetian Resort Hotel Casino", "star": "4.02", "image_url": "https://www.visitsitaly.com/tours/campania/rentals/hotel_santa_caterina/hotel_santa_caterina_pool.jpg", "rank": "1.0", "city": "Las Vegas", "reviews": [{"date": "2014-12-30", "probability": "NA", "type": "Truthful", "review": "All the rooms are suits so that gives you a lot of extra space. The bathroom is luxurious and they try really hard to be one of the nicest hotels in Vegas. I would rate them in the top 4. The nightclubs are great as are the restaurants in both the Palazzo and the Venetian. Service was good and I would definitely stay here again.", "stars": "4", "name": "Tony"}]}, "JpHE7yhMS5ehA9e8WG_ETg": {"positive": "20.9443099%", "negative": "32.9376855%", "name": "ARIA Hotel & Casino", "star": "3.66", "image_url": "https://www.visitsitaly.com/tours/campania/rentals/hotel_santa_caterina/hotel_santa_caterina_pool.jpg", "rank": "0.8", "city": "Las Vegas", "reviews": [{"date": "2014-12-30", "probability": "NA", "type": "Truthful", "review": "First time staying here.\nThis resort is the best I have stayed at in Vegas (for this price range).\nThe service was surprisingly fantastic, when walking down the halls to our room any hotel staff pulls over out of the way to wait for you to pass and ask how your stay is. This must be policy here since everyone does it from house keeping to maintenance.\nThe one and only down side is our room seemed to be about a half mile from the elevators.\nAll in I will be staying here when in Vegas!", "stars": "5", "name": "Jeff"}]}, "eWPFXL1Bmu1ImtIa2Rqliw": {"positive": "18.9083821%", "negative": "30.0%", "name": "MGM Grand Hotel", "star": "3.3", "image_url": "https://www.visitsitaly.com/tours/campania/rentals/hotel_santa_caterina/hotel_santa_caterina_pool.jpg", "rank": "0.16", "city": "Las Vegas", "reviews": [{"date": "2014-12-31", "probability": "NA", "type": "Truthful", "review": "The room  I got was small, furniture seemed old and worn out. Security box was very small. The resort fee the hotel charges is about 32 $ per night which is a lot higher...It should be charged only if one needs to use the facilities like swimming pool, cardio room ...\nFor the price they charge its not worth...\nThere were no discounts  for shows,food for those who stay in the hotel...", "stars": "2", "name": "Milind"}]}, "uJYw4p59AKh8c8h5yWMdOw": {"positive": "13.5699374%", "negative": "34.137931%", "name": "Planet Hollywood Las Vegas Resort & Casino", "star": "3.34", "image_url": "https://www.visitsitaly.com/tours/campania/rentals/hotel_santa_caterina/hotel_santa_caterina_pool.jpg", "rank": "0.21", "city": "Las Vegas", "reviews": [{"date": "2014-12-31", "probability": "NA", "type": "Truthful", "review": "Stayed here for three nights. One of the better rooms we've had on the strip. It's a well kept and nice hotel. The only drawback is the cable/satellite cots in and out quite frequently which is annoying.", "stars": "4", "name": "Mark"}]}, "AtjsjFzalWqJ7S9DUFQ4bw": {"positive": "24.8693835%", "negative": "33.2089552%", "name": "The Cosmopolitan of Las Vegas", "star": "3.97", "image_url": "https://www.visitsitaly.com/tours/campania/rentals/hotel_santa_caterina/hotel_santa_caterina_pool.jpg", "rank": "0.99", "city": "Las Vegas", "reviews": [{"date": "2014-12-30", "probability": "NA", "type": "Truthful", "review": "My BF and I stayed at the Cosmopolitan last year in June for EDC. It was fantastic. the suite was comfortable, spacious, and clean. The bed, sheets, and pillows felt like heaven, especially after a whole night of dancing. The shower was huge! The hot tube was pretty small but still a nice amenity to have. The view was great and there was more sink space than other hotels have. Over all it was a great experience. I would love to stay there again.", "stars": "5", "name": "Vann"}]}, "5paMI5Hhciyl09yGpzdoJw": {"positive": "19.4189602%", "negative": "39.0%", "name": "InterContinental Alliance Resorts THE PALAZZO", "star": "4.13", "image_url": "https://www.visitsitaly.com/tours/campania/rentals/hotel_santa_caterina/hotel_santa_caterina_pool.jpg", "rank": "1.0", "city": "Las Vegas", "reviews": [{"date": "2014-12-9", "probability": "NA", "type": "Truthful", "review": "It's a toss up for me....Palazzo or Aria.  So I try to mix it up for each trip.  This time I stayed at the Palazzo.  And I was NOT disappointed.  Never am!  The service is incredible.  I probably asked so many questions but the front desk staff answered everything.\n\nThe rooms are incredible.  You really feel comfy and like you are in \"vegas\" luxury.  And all you need to do is ask...normally you can't touch anything in the fridge or you bought it -- but for me (because I'm pregnant) they took everything out and let me use it for personal use.  Wow.  \n\nI like the security checks to get up to your room.  Just that extra level of security makes you feel more safe.\n\nAlso the access to the parking is the best in Vegas.  One elevator away.\n\nIt will be hard to go back to Aria after my last stay here :-)", "stars": "5", "name": "Nakita"}]}, "jf67Z1pnwElRSXllpQHiJg": {"positive": "22.9813665%", "negative": "28.6549708%", "name": "McCarran International Airport", "star": "3.28", "image_url": "https://www.visitsitaly.com/tours/campania/rentals/hotel_santa_caterina/hotel_santa_caterina_pool.jpg", "rank": "0.14", "city": "Las Vegas", "reviews": [{"date": "2014-12-31", "probability": "NA", "type": "Truthful", "review": "Food here isn't great as far as options go. Rarely ever win at the machines either so I'd prob not play them too often.", "stars": "3", "name": "T"}]}, "bYhpy9u8fKkGhYHtvYXazQ": {"positive": "17.3285199%", "negative": "28.436019%", "name": "Paris Las Vegas Hotel & Casino", "star": "3.22", "image_url": "https://www.visitsitaly.com/tours/campania/rentals/hotel_santa_caterina/hotel_santa_caterina_pool.jpg", "rank": "0.08", "city": "Las Vegas", "reviews": [{"date": "2014-12-28", "probability": "NA", "type": "Truthful", "review": "The Paris Hotel and Casino is now the best representation of the Parisian neighborhood of Belleville, including the grime, dirt and the old prostitutes dressed like Britney Spears. Bring hand sanitizer...\n\nThe place was run down, dirty and the hallways were disastrous. Doors with giant scuff marks and the smell of trash and old food every time you walked through them. The registration process was slow, with long lines and uncomfortable, as the woman who checked us in talked to us like we were toddlers during class. When we asked for an additional card she lectured us about not putting our cards near our cell phones, when we just needed a card for the second guest. \n\nThe room was ugly and old, no extra covers even in the middle of winter. The view was an old parking lot. Needless to say, I do not recommend this place to anyone and will never stay here again. \n\nNow to top things off, they double charged us. They charged both our credit cards the same amount and now I have the hassle of having to call the accounting department to sort this out. \n\nThe WIFI is not free, welcome back to 2005. Neither is the gym, or anything for that matter. Just a cheap, run down and ugly sight. Just like the registration desk staff.", "stars": "1", "name": "Carlos"}]}, "6LM_Klmp3hOP0JmsMCKRqQ": {"positive": "16.2162162%", "negative": "35.5902778%", "name": "Luxor Hotel And Casino Las Vegas", "star": "2.79", "image_url": "https://www.visitsitaly.com/tours/campania/rentals/hotel_santa_caterina/hotel_santa_caterina_pool.jpg", "rank": "0.0", "city": "Las Vegas", "reviews": [{"date": "2014-12-31", "probability": "NA", "type": "Truthful", "review": "Uhh don't stay here! Not an awful hotel but there are better options on the strip. The price was right and the room was decently clean. The staff has been friendly and responsive to any concerns but the location is not ideal. All the way at the end of the strip so getting anywhere takes forever! Check in was smooth and quick as well as getting our luggage up to the room. Our room was clean but the room temperature was uncomfortable. The air conditioner/heating unit was broken and our room was either freezing or a sauna...also the hotel reeks like marijuana 24/7. Our shower did not drain so showers had to be quick and you were stuck standing in your dirty shower water. The Wifi was also slow and cut out frequently. The room was very basic-no fridge or microwave. Overall the Luxor was okay but if it's not a holiday week there are definitely other comparably priced better hotels on the Strip!", "stars": "2", "name": "Julie"}]}, "WIlklz81DcJkUWJThbnJbQ": {"positive": "14.6875%", "negative": "21.969697%", "name": "Vdara Hotel", "star": "3.89", "image_url": "https://www.visitsitaly.com/tours/campania/rentals/hotel_santa_caterina/hotel_santa_caterina_pool.jpg", "rank": "0.98", "city": "Las Vegas", "reviews": [{"date": "2014-12-30", "probability": "NA", "type": "Truthful", "review": "Absolutely stunning hotel! Beautiful lobby and bar. Valet staff quick and courteous. Front desk amazingly helpful. Our two bedroom suite was breathtaking! Very spacious with modern furniture. Quick walk to either Aria or Cosmopolitan if you want to gamble or convenient tram to bellagio. I actually left behind an item and contacted customer service/concierge who quickly located it and proceeded to immediately send it to me despite the busy holiday season. Look forward to staying there again soon!", "stars": "5", "name": "Gianna"}]}}